Autodesk.Revit.DB.XYZ.Item(System.Int32)
Indexed access to coordinates.
idx: Use 0 for X, 1 for Y and 2 for Z.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an attempt is made to access the coordinate
with an index that is larger than 2.